{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/jiuyuanx/11663-LLM/blob/main/LLM_eval.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "5ImWHrK0RgFv"
      },
      "outputs": [],
      "source": [
        "!pip install -q neo4j"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "3XX9AkpOR28i"
      },
      "outputs": [],
      "source": [
        "!pip install -q langchain"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "8v43rQltRi1J"
      },
      "outputs": [],
      "source": [
        "import pandas as pd\n",
        "import numpy as np\n",
        "from neo4j import GraphDatabase\n",
        "from langchain.chains import GraphCypherQAChain\n",
        "from langchain.graphs import Neo4jGraph"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "ASQI3QCORsOG"
      },
      "outputs": [],
      "source": [
        "def run(driver,query): #cypher query runner\n",
        "    with driver.session() as session:\n",
        "        return [r for r in session.run(query)]"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "q7pIt477Rv4R"
      },
      "outputs": [],
      "source": [
        "url = \"neo4j+s://8e7ec38d.databases.neo4j.io\"\n",
        "username=\"neo4j\"\n",
        "password=\"xnC4LX_6kXfK08QZVefd7tCqui7lBKxnAr_DeQJKiRY\"\n",
        "\n",
        "graph = Neo4jGraph(\n",
        "    url=url,\n",
        "    username=username,\n",
        "    password=password)"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# run(driver,'.')"
      ],
      "metadata": {
        "id": "yT8EQp_airL8"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "Db9n4JH-R6GU"
      },
      "outputs": [],
      "source": [
        "df = pd.read_csv(\"llm_all_v3.csv\")\n",
        "df.head(5)\n",
        "df['llama_cleaned_generations'] = df['llama_cleaned_generations'].apply(lambda x: x.replace('[]', '.'))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 764
        },
        "id": "Fmy4mRYRSGPy",
        "outputId": "417f3719-2d70-4cd8-fda2-a1863c6aebb0"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "   Unnamed: 0.1  Unnamed: 0  \\\n",
              "0             0           0   \n",
              "1             1           1   \n",
              "4             4           4   \n",
              "5             5           5   \n",
              "6             6           6   \n",
              "\n",
              "                                              prompt  \\\n",
              "0  Given my Neo4j database schema:[<Record nodes=...   \n",
              "1  Given my Neo4j database schema:[<Record nodes=...   \n",
              "4  Given my Neo4j database schema:[<Record nodes=...   \n",
              "5  Given my Neo4j database schema:[<Record nodes=...   \n",
              "6  Given my Neo4j database schema:[<Record nodes=...   \n",
              "\n",
              "                                    palm_generations  \\\n",
              "0                    MATCH (p:paper) RETURN count(p)   \n",
              "1                   MATCH (a:author) RETURN count(a)   \n",
              "4  MATCH (p:paper)-[r:paper_cite_paper]->(p2:pape...   \n",
              "5  MATCH (p:paper)-[r:paper_cite_paper]->(p2:pape...   \n",
              "6  ```\\nMATCH (p:paper)-[r:paper_cite_paper]->(c:...   \n",
              "\n",
              "                                            question  \\\n",
              "0               How many papers are in the database?   \n",
              "1                       Count the number of authors.   \n",
              "4     How many papers cite at least one other paper?   \n",
              "5  How many papers are cited by at least one othe...   \n",
              "6  How many papers are cited by at least ten othe...   \n",
              "\n",
              "                                              cypher  test  \\\n",
              "0      MATCH (p:paper) RETURN count(p) AS num_papers     1   \n",
              "1    MATCH (a:Author) RETURN count(a) AS authorCount     1   \n",
              "4  MATCH (p:paper)-[:paper_cite_paper]->(:paper)\\...     1   \n",
              "5  MATCH (other:paper)-[:paper_cite_paper]->(p:pa...     1   \n",
              "6  MATCH (p:paper)<-[:paper_cite_paper]-(:paper)\\...     1   \n",
              "\n",
              "                         fine_tuned_palm_generations  \\\n",
              "0                   MATCH (p:paper)\\nRETURN COUNT(p)   \n",
              "1   MATCH (a:author)\\nRETURN COUNT(a) AS authorCount   \n",
              "4   MATCH (p:paper)-[:paper_cite_paper]->(:paper)...   \n",
              "5   MATCH (p:paper)<-[:paper_cite_paper]-(citingP...   \n",
              "6  MATCH (p:paper)<-[:paper_cite_paper]-(citing:p...   \n",
              "\n",
              "                        fine_tuned_llama_generations  \\\n",
              "0  <s> Generate cypher query for the question: Ho...   \n",
              "1  <s> Generate cypher query for the question: Co...   \n",
              "4  <s> Generate cypher query for the question: Ho...   \n",
              "5  <s> Generate cypher query for the question: Ho...   \n",
              "6  <s> Generate cypher query for the question: Ho...   \n",
              "\n",
              "                fine_tuned_llama_cleaned_generations  \\\n",
              "0      MATCH (p:paper) RETURN count(p) AS num_papers   \n",
              "1   MATCH (a:Author)\\nRETURN count(a) AS authorCount   \n",
              "4  MATCH (p:paper)-[:paper_cite_paper]->(:paper)\\...   \n",
              "5  MATCH (p:paper)<-[:paper_cite_paper]-(:paper)\\...   \n",
              "6  MATCH (p:paper)<-[:paper_cite_paper]-(:paper)\\...   \n",
              "\n",
              "                                   llama_generations  \\\n",
              "0    To answer the question \"How many papers are ...   \n",
              "1    Sure! Here's a Cypher query to count the num...   \n",
              "4  To answer the question \"How many papers cite a...   \n",
              "5  To answer the question \"How many papers are ci...   \n",
              "6  To find the number of papers that are cited by...   \n",
              "\n",
              "                           llama_cleaned_generations  \\\n",
              "0          \\nMATCH (p:Paper) RETURN p.id, COUNT(p)\\n   \n",
              "1               \\nMATCH (a:Author) RETURN COUNT(a)\\n   \n",
              "4  MATCH (p1:Paper)-[:CITES {num_cites: > 1}]- (p...   \n",
              "5  MATCH (p:Paper)-[:CITES {num_cites: > 1}]-()\\n...   \n",
              "6  MATCH (p:Paper)-[:CITES {numCitations: > 10}]-...   \n",
              "\n",
              "                                     gpt_generations  \\\n",
              "0                   MATCH (p:paper)\\nRETURN count(p)   \n",
              "1   MATCH (a:author)\\nRETURN count(a) AS authorCount   \n",
              "4  MATCH (p1:paper)-[:paper_cite_paper]->(p2:pape...   \n",
              "5  MATCH (p:paper)-[:paper_cite_paper]->(:paper)\\...   \n",
              "6  MATCH (p:paper)-[:paper_cite_paper]->(:paper)\\...   \n",
              "\n",
              "                          gpt_fine_tuned_generations  \n",
              "0      MATCH (p:paper) RETURN count(p) AS num_papers  \n",
              "1    MATCH (a:Author) RETURN count(a) AS authorCount  \n",
              "4  MATCH (p:paper)-[:paper_cite_paper]->(:paper)\\...  \n",
              "5  MATCH (p:paper)<-[:paper_cite_paper]-(:paper) ...  \n",
              "6  MATCH (p:paper)<-[:paper_cite_paper]-(:paper)\\...  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-70b2cafc-28f4-4c6e-9412-c44ec13a8c06\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Unnamed: 0.1</th>\n",
              "      <th>Unnamed: 0</th>\n",
              "      <th>prompt</th>\n",
              "      <th>palm_generations</th>\n",
              "      <th>question</th>\n",
              "      <th>cypher</th>\n",
              "      <th>test</th>\n",
              "      <th>fine_tuned_palm_generations</th>\n",
              "      <th>fine_tuned_llama_generations</th>\n",
              "      <th>fine_tuned_llama_cleaned_generations</th>\n",
              "      <th>llama_generations</th>\n",
              "      <th>llama_cleaned_generations</th>\n",
              "      <th>gpt_generations</th>\n",
              "      <th>gpt_fine_tuned_generations</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>0</td>\n",
              "      <td>0</td>\n",
              "      <td>Given my Neo4j database schema:[&lt;Record nodes=...</td>\n",
              "      <td>MATCH (p:paper) RETURN count(p)</td>\n",
              "      <td>How many papers are in the database?</td>\n",
              "      <td>MATCH (p:paper) RETURN count(p) AS num_papers</td>\n",
              "      <td>1</td>\n",
              "      <td>MATCH (p:paper)\\nRETURN COUNT(p)</td>\n",
              "      <td>&lt;s&gt; Generate cypher query for the question: Ho...</td>\n",
              "      <td>MATCH (p:paper) RETURN count(p) AS num_papers</td>\n",
              "      <td>To answer the question \"How many papers are ...</td>\n",
              "      <td>\\nMATCH (p:Paper) RETURN p.id, COUNT(p)\\n</td>\n",
              "      <td>MATCH (p:paper)\\nRETURN count(p)</td>\n",
              "      <td>MATCH (p:paper) RETURN count(p) AS num_papers</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>1</td>\n",
              "      <td>1</td>\n",
              "      <td>Given my Neo4j database schema:[&lt;Record nodes=...</td>\n",
              "      <td>MATCH (a:author) RETURN count(a)</td>\n",
              "      <td>Count the number of authors.</td>\n",
              "      <td>MATCH (a:Author) RETURN count(a) AS authorCount</td>\n",
              "      <td>1</td>\n",
              "      <td>MATCH (a:author)\\nRETURN COUNT(a) AS authorCount</td>\n",
              "      <td>&lt;s&gt; Generate cypher query for the question: Co...</td>\n",
              "      <td>MATCH (a:Author)\\nRETURN count(a) AS authorCount</td>\n",
              "      <td>Sure! Here's a Cypher query to count the num...</td>\n",
              "      <td>\\nMATCH (a:Author) RETURN COUNT(a)\\n</td>\n",
              "      <td>MATCH (a:author)\\nRETURN count(a) AS authorCount</td>\n",
              "      <td>MATCH (a:Author) RETURN count(a) AS authorCount</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>4</td>\n",
              "      <td>4</td>\n",
              "      <td>Given my Neo4j database schema:[&lt;Record nodes=...</td>\n",
              "      <td>MATCH (p:paper)-[r:paper_cite_paper]-&gt;(p2:pape...</td>\n",
              "      <td>How many papers cite at least one other paper?</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)\\...</td>\n",
              "      <td>1</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)...</td>\n",
              "      <td>&lt;s&gt; Generate cypher query for the question: Ho...</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)\\...</td>\n",
              "      <td>To answer the question \"How many papers cite a...</td>\n",
              "      <td>MATCH (p1:Paper)-[:CITES {num_cites: &gt; 1}]- (p...</td>\n",
              "      <td>MATCH (p1:paper)-[:paper_cite_paper]-&gt;(p2:pape...</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)\\...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>5</td>\n",
              "      <td>5</td>\n",
              "      <td>Given my Neo4j database schema:[&lt;Record nodes=...</td>\n",
              "      <td>MATCH (p:paper)-[r:paper_cite_paper]-&gt;(p2:pape...</td>\n",
              "      <td>How many papers are cited by at least one othe...</td>\n",
              "      <td>MATCH (other:paper)-[:paper_cite_paper]-&gt;(p:pa...</td>\n",
              "      <td>1</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(citingP...</td>\n",
              "      <td>&lt;s&gt; Generate cypher query for the question: Ho...</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(:paper)\\...</td>\n",
              "      <td>To answer the question \"How many papers are ci...</td>\n",
              "      <td>MATCH (p:Paper)-[:CITES {num_cites: &gt; 1}]-()\\n...</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)\\...</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(:paper) ...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>6</td>\n",
              "      <td>6</td>\n",
              "      <td>Given my Neo4j database schema:[&lt;Record nodes=...</td>\n",
              "      <td>```\\nMATCH (p:paper)-[r:paper_cite_paper]-&gt;(c:...</td>\n",
              "      <td>How many papers are cited by at least ten othe...</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(:paper)\\...</td>\n",
              "      <td>1</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(citing:p...</td>\n",
              "      <td>&lt;s&gt; Generate cypher query for the question: Ho...</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(:paper)\\...</td>\n",
              "      <td>To find the number of papers that are cited by...</td>\n",
              "      <td>MATCH (p:Paper)-[:CITES {numCitations: &gt; 10}]-...</td>\n",
              "      <td>MATCH (p:paper)-[:paper_cite_paper]-&gt;(:paper)\\...</td>\n",
              "      <td>MATCH (p:paper)&lt;-[:paper_cite_paper]-(:paper)\\...</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-70b2cafc-28f4-4c6e-9412-c44ec13a8c06')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-70b2cafc-28f4-4c6e-9412-c44ec13a8c06 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-70b2cafc-28f4-4c6e-9412-c44ec13a8c06');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-42794610-7ac4-494a-a297-5d275a102f61\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-42794610-7ac4-494a-a297-5d275a102f61')\"\n",
              "            title=\"Suggest charts\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "      --bg-color: #E8F0FE;\n",
              "      --fill-color: #1967D2;\n",
              "      --hover-bg-color: #E2EBFA;\n",
              "      --hover-fill-color: #174EA6;\n",
              "      --disabled-fill-color: #AAA;\n",
              "      --disabled-bg-color: #DDD;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "      --bg-color: #3B4455;\n",
              "      --fill-color: #D2E3FC;\n",
              "      --hover-bg-color: #434B5C;\n",
              "      --hover-fill-color: #FFFFFF;\n",
              "      --disabled-bg-color: #3B4455;\n",
              "      --disabled-fill-color: #666;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart {\n",
              "    background-color: var(--bg-color);\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: var(--fill-color);\n",
              "    height: 32px;\n",
              "    padding: 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: var(--hover-bg-color);\n",
              "    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: var(--button-hover-fill-color);\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart-complete:disabled,\n",
              "  .colab-df-quickchart-complete:disabled:hover {\n",
              "    background-color: var(--disabled-bg-color);\n",
              "    fill: var(--disabled-fill-color);\n",
              "    box-shadow: none;\n",
              "  }\n",
              "\n",
              "  .colab-df-spinner {\n",
              "    border: 2px solid var(--fill-color);\n",
              "    border-color: transparent;\n",
              "    border-bottom-color: var(--fill-color);\n",
              "    animation:\n",
              "      spin 1s steps(1) infinite;\n",
              "  }\n",
              "\n",
              "  @keyframes spin {\n",
              "    0% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "      border-left-color: var(--fill-color);\n",
              "    }\n",
              "    20% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    30% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    40% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    60% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    80% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "    90% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const quickchartButtonEl =\n",
              "        document.querySelector('#' + key + ' button');\n",
              "      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n",
              "      quickchartButtonEl.classList.add('colab-df-spinner');\n",
              "      try {\n",
              "        const charts = await google.colab.kernel.invokeFunction(\n",
              "            'suggestCharts', [key], {});\n",
              "      } catch (error) {\n",
              "        console.error('Error during call to suggestCharts:', error);\n",
              "      }\n",
              "      quickchartButtonEl.classList.remove('colab-df-spinner');\n",
              "      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-42794610-7ac4-494a-a297-5d275a102f61 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 35
        }
      ],
      "source": [
        "df_test = df[df['test']==1]\n",
        "df_train = df[df['test']==0]\n",
        "df_test.head(5)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 35
        },
        "id": "Kca3KzuoTEHF",
        "outputId": "5469d9b6-4242-432a-c026-61dcec65dc08"
      },
      "outputs": [
        {
          "data": {
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            },
            "text/plain": [
              "'MATCH (p:paper)\\nRETURN count(p)'"
            ]
          },
          "execution_count": 8,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "df.iloc[0]['gpt_generations']"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "VPyYLEIuvj7D"
      },
      "source": [
        "# **test**"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 67,
          "referenced_widgets": [
            "cbfac6fefd544f10935b976d8c4444c6",
            "bcd29cbfd8294c0eb0b61a995d1cf5e2",
            "ce5b619804454692a7548fd033b0d18c",
            "f29cdc9554684c7980672c4f769100ee",
            "71a6d76b6ee448a8b5ef00dd022aee05",
            "58d459d442d84413a663e80d064d61ed",
            "32265b82ac144c20943a43b9ad495a5a",
            "811a4a42b9cf4ec5951eaf59d77a3c5e",
            "baff0294370849ef8794b3795d259cee",
            "7add8be5deba439f9da58d636c7e626f",
            "f49c81ec2a7e466496459a989236999c"
          ]
        },
        "id": "oqgYEotOSQJQ",
        "outputId": "4360b214-4b14-479a-84e1-718d97c9917a"
      },
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "evaluating...:   0%|          | 0/56 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "cbfac6fefd544f10935b976d8c4444c6"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "array([26., 54.,  9., 50., 46., 54.])"
            ]
          },
          "metadata": {},
          "execution_count": 30
        }
      ],
      "source": [
        "from tqdm.auto import tqdm\n",
        "driver = GraphDatabase.driver(url, auth=(username, password))\n",
        "results = np.zeros(6) #6 models runnable cypher\n",
        "for i in tqdm(range(len(df_test)), \"evaluating...\"):\n",
        "  row = df.iloc[i]\n",
        "  palm2 = row['palm_generations']\n",
        "  palm2_fine_tuned = row['fine_tuned_palm_generations']\n",
        "  llama2 = row['llama_cleaned_generations']\n",
        "  llama2_fine_tuned = row['fine_tuned_llama_cleaned_generations']\n",
        "  gpt = row['gpt_generations']\n",
        "  gpt_fine_tuned = row['gpt_fine_tuned_generations']\n",
        "  cyphers  = [palm2, palm2_fine_tuned, llama2,llama2_fine_tuned, gpt, gpt_fine_tuned]\n",
        "  for j, cy in enumerate(cyphers):\n",
        "    try:\n",
        "      cypher = cy.lower()\n",
        "      out = run(driver, cypher)\n",
        "      if out !=[]:\n",
        "        results[j]+=1\n",
        "    except:\n",
        "      pass\n",
        "\n",
        "results\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "ZNdyc-95vlrx"
      },
      "source": [
        "# **test all**"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000,
          "referenced_widgets": [
            "6d8654d349af4660b9daaf05da61ffe3",
            "655c98692d954fddbb2d88f9874687e1",
            "e03c599059694d2fb5654d59c7a7a2a3",
            "ec52496af3be40bdbb78e08c2d4404ee",
            "86038e18c173415aa2283944f9fdeb1a",
            "09821c037d4649ff86a092eb05941ac7",
            "739141131b314476ad02f50e52cfa755",
            "595ad28f9d204b9ebb06338c06d5795e",
            "ffbebf48d26f4698a129f327cd4829ed",
            "1e40d61512f441ffbe14bfbefb1077f4",
            "0d2612c4c9c646389f0c8301707b0cdb"
          ]
        },
        "id": "pZZrGlKwUbu9",
        "outputId": "59c94d8a-5148-4b31-cf6f-4526aa074a8c"
      },
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "evaluating...:   0%|          | 0/219 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "6d8654d349af4660b9daaf05da61ffe3"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "0 \n",
            "MATCH (p:Paper) RETURN p.id, COUNT(p)\n",
            "\n",
            "1 \n",
            "MATCH (a:Author) RETURN COUNT(a)\n",
            "\n",
            "2 \n",
            "MATCH (c:Conference) RETURN c.name\n",
            "\n",
            "3 \n",
            "MATCH (a:Author {name: \"Daphne Koller\"})-[:AUTHORED_PAPER]->(p:Paper) RETURN p\n",
            "\n",
            "4 MATCH (p1:Paper)-[:CITES {num_cites: > 1}]- (p2:Paper)\n",
            "RETURN p1.name, p2.name, COUNT(p1)\n",
            "5 MATCH (p:Paper)-[:CITES {num_cites: > 1}]-()\n",
            "RETURN p.name, COUNT(p)\n",
            "6 MATCH (p:Paper)-[:CITES {numCitations: > 10}]->(otherPaper:Paper)\n",
            "RETURN otherPaper.name, COUNT(otherPaper)\n",
            "7 \n",
            "MATCH (n:DOMAIN) RETURN COUNT(n)\n",
            "\n",
            "8 \n",
            "MATCH (a:affiliation) RETURN a\n",
            "\n",
            "9 \n",
            "MATCH (n:DOMAIN)\n",
            "RETURN n.name\n",
            "\n",
            "10 \n",
            "MATCH (p:Paper)\n",
            "WHERE p.domain = 'Computer Science'\n",
            "RETURN p\n",
            "\n",
            "11 \n",
            "MATCH (p:Paper)-[:PRESENTED_AT]->(c:Conference {name: 'AAAI'})\n",
            "RETURN p.title, c.name\n",
            "\n",
            "12 \n",
            "MATCH (n:affiliation) RETURN COUNT(n)\n",
            "\n",
            "13 .\n",
            "14 MATCH (p:Paper)-[r:CITES]->(c:Paper)\n",
            "WHERE r.num_cites > 3\n",
            "RETURN p.name, r.num_cites\n",
            "15 \n",
            "MATCH (c:Conference)\n",
            "MATCH (p:Paper)\n",
            "WHERE p.conference = c\n",
            "RETURN c.name, COUNT(p)\n",
            "\n",
            "16 \n",
            "MATCH (d:domain)\n",
            "WHERE NOT (d) // Remove domains with no papers\n",
            "RETURN d.name\n",
            "\n",
            "17 MATCH (p:Paper)-[:CITES {source: \"domain\"}]-(d:Domain)\n",
            "RETURN d.name AS domain_name\n",
            "ORDER BY COUNT(d) DESC\n",
            "LIMIT 1\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Failed to read from defunct connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "18 MATCH (n:AUTHOR)-[:CITES {num_cites: > 10}]->(p:PAPER)\n",
            "RETURN n.name, p.name, p.num_cites\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "19 MATCH (p:Paper)-[:CITES {num_cites: > 1}]-()\n",
            "RETURN p\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "20 MATCH (a:Author)-[:AUTHOR_OF {num_authors: 10}]-()\n",
            "RETURN a.name, COUNT(a) AS num_authors\n",
            "ORDER BY num_authors DESC\n",
            "LIMIT 5\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "21 MATCH (a:Author)-[:WRITTEN_PAPER]->(p:Paper)\n",
            "RETURN p.name, a.name, COUNT(p) AS count\n",
            "ORDER BY count(p) DESC\n",
            "LIMIT 10;\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "22 .\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "23 MATCH (a:Author)-[:PRESENTED_AT]->(c:Conference)\n",
            "WHERE COUNT(a) > 2\n",
            "RETURN a.name\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "24 MATCH (p:Paper)-[:CITES {num_domains: >2}]-()\n",
            "RETURN p\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "25 MATCH (p:Paper)\n",
            "RETURN p.name, p.citationCount\n",
            "ORDER BY p.citationCount DESC\n",
            "LIMIT 5\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "26 MATCH (a:Author)-[:PUBLISHED {domain:d}]-(p:Paper)\n",
            "WHERE d IN [{\"domain1\", \"domain2\", \"domain3\",...} ]\n",
            "RETURN a.name, COUNT(p) AS countOfPapersInDomain\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "27 \n",
            "MATCH (p:Paper)-[:PUBLISHED]->()\n",
            "WHERE p.domain = 'Machine Learning'\n",
            "RETURN p.title, p.year\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "28 MATCH (a:Author)-[:HAS_PAPER]->(p:Paper)\n",
            "WHERE a.conference_count > 3\n",
            "RETURN a.name, a.conference_count\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "29 \n",
            "MATCH (author:Person {name: \"Daphne Koller\"})-[:PRESENTED_AT]->(conference:Conference)\n",
            "RETURN conference.name\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "30 .\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "31 MATCH (a:Author)-[:AFFILIATED_WITH]->(affiliation:Affiliation)\n",
            "WHERE a.affiliations.size() > 1\n",
            "RETURN a.name, affiliation.name\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "32 \n",
            "MATCH (p:Paper)-[:PUBLISHED_IN]->(j:Conference {name: \"AAAI\"})\n",
            "RETURN p.citations_count\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "33 MATCH (p:Paper)-[:CITES {num_domains: > 1}]-()\n",
            "RETURN p\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "34 \n",
            "MATCH (p:Paper)-[:CITES {domain: \"Machine Learning\"}]-(c:Paper)\n",
            "MATCH (p:Paper)-[:CITES {domain: \"Computational Biology\"}]-(c:Paper)\n",
            "RETURN p, c\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "35 \n",
            "MATCH (p:Paper)-[:PRESENTED_AT]->(icml:ICML)\n",
            "RETURN p.name, icml.name\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "36 \n",
            "MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE p.domain = 'Genomics'\n",
            "RETURN a.name\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "37 \n",
            "MATCH (c:Conference) RETURN c\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "38 \n",
            "MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE a.institution = 'Carnegie Mellon University' AND p.topic = 'Artificial Intelligence'\n",
            "RETURN a.name, p.title\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "39 .\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "40 cypher\n",
            "MATCH (paper:Paper)-[:CITES {cite_count: 1}]-(citing_paper:Paper)\n",
            "RETURN paper.title, citing_paper.title\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "41 MATCH (a:Author)-[:WRITTEN_PAPER]->(p:Paper)\n",
            "WHERE COUNT(p) > 5\n",
            "RETURN a\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "42 \n",
            "MATCH (p:Paper)-[:PRESENTED_AT]->(conf:Conference {name: 'AAAI'})\n",
            "RETURN p.domain\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        }
      ],
      "source": [
        "from tqdm.auto import tqdm\n",
        "import time\n",
        "driver = GraphDatabase.driver(url, auth=(username, password))\n",
        "results_all = np.zeros(6) #6 models runnable cypher\n",
        "for i in tqdm(range(len(df)), \"evaluating...\"):\n",
        "  row = df.iloc[i]\n",
        "  palm2 = row['palm_generations']\n",
        "  palm2_fine_tuned = row['fine_tuned_palm_generations']\n",
        "  llama2 = row['llama_cleaned_generations']\n",
        "  llama2_fine_tuned = row['fine_tuned_llama_cleaned_generations']\n",
        "  gpt = row['gpt_generations']\n",
        "  gpt_fine_tuned = row['gpt_fine_tuned_generations']\n",
        "  # print(llama2)\n",
        "  cyphers  = [palm2, palm2_fine_tuned, llama2,llama2_fine_tuned, gpt, gpt_fine_tuned]\n",
        "  for j, cy in enumerate(cyphers):\n",
        "    try:\n",
        "      cypher = cy.lower()\n",
        "      out = run(driver, cypher)\n",
        "      if out !=[]:\n",
        "        results_all[j]+=1\n",
        "    except:\n",
        "      pass\n",
        "  print(i,llama2)\n",
        "  if i ==130: #reconnect to avoid api error\n",
        "    time.sleep(100)\n",
        "    graph = Neo4jGraph(\n",
        "    url=url,\n",
        "    username=username,\n",
        "    password=password)\n",
        "    driver = GraphDatabase.driver(url, auth=(username, password))\n",
        "\n",
        "\n",
        "results_all\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "for i in tqdm(range(130, len(df)), \"evaluating...\"):\n",
        "  row = df.iloc[i]\n",
        "  palm2 = row['palm_generations']\n",
        "  palm2_fine_tuned = row['fine_tuned_palm_generations']\n",
        "  llama2 = row['llama_cleaned_generations']\n",
        "  llama2_fine_tuned = row['fine_tuned_llama_cleaned_generations']\n",
        "  gpt = row['gpt_generations']\n",
        "  gpt_fine_tuned = row['gpt_fine_tuned_generations']\n",
        "  # print(llama2)\n",
        "  cyphers  = [palm2, palm2_fine_tuned, llama2,llama2_fine_tuned, gpt, gpt_fine_tuned]\n",
        "\n",
        "  for j, cy in enumerate(cyphers):\n",
        "    try:\n",
        "      cypher = cy.lower()\n",
        "      out = run(driver, cypher)\n",
        "      if out !=[]:\n",
        "        results_all[j]+=1\n",
        "    except:\n",
        "      pass\n",
        "  print(i, llama2)\n",
        "  # if i in np.arange(30,len(df), 50): #reconnect to avoid api error\n",
        "  #   time.sleep(100)\n",
        "  #   graph = Neo4jGraph(\n",
        "  #   url=url,\n",
        "  #   username=username,\n",
        "  #   password=password)\n",
        "  #   driver = GraphDatabase.driver(url, auth=(username, password))\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000,
          "referenced_widgets": [
            "a4684766f9704508aa8b951673caf01f",
            "269fe17ff72e4e15851db7004c7d83b2",
            "9c4d1e272a2d4c35afe2d550a0fcea2e",
            "85435a6a73d34a688368cf240bd2e0f8",
            "e78d417f63fe4f6faa1fe89467c7f607",
            "2771479d111841aea723c611e1fd7ecd",
            "58a265098ad34213b26d95e9bb9ad9de",
            "7ae4ded16aa049a4bbaafa4830806c13",
            "63fb3148442749129773bdaecb3cb7fb",
            "f71898e77b2f4ee7ba603cbd6cf7a08a",
            "75c967d9fdff4ed4a8f9302efa9006b5"
          ]
        },
        "id": "-_7NuGJYbHY8",
        "outputId": "235cbb1c-6ec9-49a0-99d8-3b5ca5fbc672"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "evaluating...:   0%|          | 0/89 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "a4684766f9704508aa8b951673caf01f"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "130 MATCH (a:Author)-[R]->(b:Author)\n",
            "WHERE a.domain = 'Machine Learning' AND b.domain = 'Machine Learning'\n",
            "RETURN a.name, b.name, COUNT(R)\n",
            "ORDER BY COUNT(R) DESC\n",
            "LIMIT 1\n",
            "131 MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE p.domain = 'Artificial Intelligence'\n",
            "RETURN a.name\n",
            "ORDER BY COUNT(p) DESC\n",
            "LIMIT 1\n",
            "132 \n",
            "MATCH (p:Conference)-[:PUBLISHED]->(p:Paper)\n",
            "RETURN p.citations_count\n",
            "GROUP BY p.conference_name\n",
            "SUM p.citations_count\n",
            "\n",
            "133 MATCH (p:Paper)-[:PUBLISHED]->()\n",
            "WHERE p.domain = 'Data Mining'\n",
            "RETURN p.year\n",
            "ORDER BY p.year DESC\n",
            "LIMIT 1;\n",
            "134 \n",
            "MATCH (a:Author)\n",
            "WHERE a.fieldOfInterest = 'Computer Vision'\n",
            "MATCH (a)-[:CO_AUTHOR {role: 'CO-AUTHOR'}]-()\n",
            "RETURN a.name, COUNT(a)\n",
            "\n",
            "135 MATCH (p:Paper)-[:CITES {count: > 5}]->(c:Paper)\n",
            "RETURN p.name, count(c)\n",
            "136 \n",
            "MATCH (n:UNIVERSITY)\n",
            "WHERE n.field = 'Cloud Computing'\n",
            "RETURN n.name, COUNT(n.id)\n",
            "\n",
            "137 \n",
            "MATCH (p:Paper)-[:CITES {cite_text: \"learning to rank using gradient descent\"}]-()\n",
            "RETURN p.venue\n",
            "\n",
            "138 MATCH (n:AUTHOR {INSTITUTION: 'University of Oxford'})-[:PUBLISHED {YEAR: > 2010}]-()\n",
            "RETURN n.name, COUNT(n) AS frequency\n",
            "139 \n",
            "MATCH (a:affiliation)-[:PUBLISHES]->(p:paper)\n",
            "WHERE p.conference.name = 'ACL'\n",
            "AND a.name IN (\n",
            "  SELECT name FROM Affiliation WHERE label = 'Artificial Intelligence'\n",
            ")\n",
            "RETURN a.name\n",
            "\n",
            "140 []\n",
            "141 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE a.affiliation = \"University of Oxford\"\n",
            "AND p.field(\"significance\") = \"significant\"\n",
            "RETURN p\n",
            "\n",
            "142 MATCH (c:Conference {name: 'ACL'})\n",
            "MATCH (p:Paper {conference: c})\n",
            "MATCH (p)-[:MAIN_RESEARCH_AREA]->(a:Area)\n",
            "RETURN a.name\n",
            "ORDER BY COUNT(a) DESC\n",
            "LIMIT 5\n",
            "143 \n",
            "MATCH (p:Paper)-[:PUBLISHED_IN]->(c:Conference)\n",
            "WHERE p.domain = 'Machine Learning' AND c.name = 'ACL' AND p.author = 'Columbia University'\n",
            "RETURN p.title, p.year\n",
            "\n",
            "144 MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE a.institution = 'Columbia University' AND p.conference = 'ACL'\n",
            "RETURN a.name, COUNT(p) AS num_papers\n",
            "ORDER BY num_papers DESC\n",
            "LIMIT 10;\n",
            "145 cypher\n",
            "MATCH (p:Paper) WHERE author(\"Zhouchen Lin\") RETURN p\n",
            "\n",
            "146 \n",
            "MATCH (n:paper)\n",
            "WHERE n.labels IN ['Machine Learning', 'Mathematical Optimization']\n",
            "RETURN n\n",
            "\n",
            "147 MATCH (n:INSTITUTION{name: 'Tsinghua University'})\n",
            "MATCH (n)-[:PUBLISHED_ARTICLE]->(p:PUBLICATION)\n",
            "WHERE p.year >= 2020\n",
            "RETURN p.title, p.year\n",
            "148 MATCH (p:Paper)-[:CITES {weight: 1}]-(m:Paper)\n",
            "WHERE p.domain = 'Machine Learning'\n",
            "RETURN p, m\n",
            "149 \n",
            "MATCH (p:Paper)-[:HAS_THEME]->(t:Theme)\n",
            "WHERE t.name = 'Computational Biology' AND t.name = 'Computer Science'\n",
            "RETURN p.name\n",
            "\n",
            "150 \n",
            "MATCH (n:Author)-[:CITES {field:\"ML\"}]-()\n",
            "RETURN n.name, n.citations\n",
            "\n",
            "151 cypher\n",
            "MATCH (c:Conference)\n",
            "WHERE c.name = 'Tsinghua University'\n",
            "MATCH (p:Presentation) -[r:presented_by]- (c)\n",
            "WHERE r.type = 'paper'\n",
            "WITH c, COUNT(p) AS num_papers\n",
            "RETURN c.name, num_papers\n",
            "ORDER BY num_papers DESC\n",
            "\n",
            "152 \n",
            "MATCH (author:ChengSoonOng)\n",
            "MATCH (paper:Paper)\n",
            "WHERE (author)[:HAS_AUTHOR] (paper)\n",
            "RETURN paper.name, paper.year, paper.challenges\n",
            "\n",
            "153 []\n",
            "154 MATCH (p:Paper)-[:CITES {num_cites: > 10}]->(c:Paper)\n",
            "WHERE p.domain = 'Artificial Intelligence'\n",
            "RETURN p.title, p.authors, p.year, p.num_cites\n",
            "155 \n",
            "MATCH (p:Paper)-[:CITES {source: \"Johns Hopkins University\"}]-()\n",
            "MATCH (p)-[:FEATURED_IN {conference: \"ICML\"}]-()\n",
            "RETURN p\n",
            "\n",
            "156 MATCH (a:Author {name: 'Sebastian Thrun'})\n",
            "MATCH (p:Paper {field: 'Machine Learning'})\n",
            "MATCH (a)-[r:PUBLISHED*1..]->(p)\n",
            "RETURN COUNT(r)\n",
            "157 cypher\n",
            "MATCH (p:Paper)\n",
            "WHERE p.cite_key = 'Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data'\n",
            "RETURN p\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Failed to read from defunct connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "158 \n",
            "MATCH (p:Paper)-[:PRESENTED_AT]->(a:Affiliation)\n",
            "WHERE a.name = 'Carnegie Mellon University'\n",
            "RETURN p.name, p.author, p.venue, p.year\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "159 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE p.title = 'in-network pca and anomaly detection' AND a.name = 'Michael I Jordan'\n",
            "RETURN a.name\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "160 MATCH (p:Paper)-[:CITES {num_times: >0}]-(c:Citation)\n",
            "RETURN p.name, COUNT(c) AS num_times\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "161 \n",
            "MATCH (n:Author)-[:CITES {author: \"Daphne Koller\"}]-()\n",
            "RETURN n.name, n.affiliation, n.domain\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "162 MATCH (s:author)-[:PUBLISHED {year: 2015}]-()\n",
            "MATCH (s)-[:COAUTHOR {author: \"Sebastian Thrun\"]]->()\n",
            "RETURN s.name, s.affiliation, s.citations\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "163 \n",
            "MATCH (a:Author)-[:PUBLISHED_IN]->(p:Paper)\n",
            "WHERE a.institution = 'Johns Hopkins University' AND p.conference = 'AAAI'\n",
            "RETURN a.name, COUNT(p)\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "164 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE a.name = 'Natural Language Processing'\n",
            "RETURN p.name, COUNT(p)\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "165 \n",
            "MATCH (n:POLICY_RESEARCH) WHERE (n.CONFERENCE = 'ICML') RETURN n.TREND\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "166 MATCH (a:author)-[:PUBLISHES {paper:PAPER {name: \"Robotics\"}}]-()\n",
            "WHERE a.affiliation = 'Carnegie Mellon University'\n",
            "RETURN a.name, COUNT(a) AS count\n",
            "ORDER BY count DESC\n",
            "LIMIT 5\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "167 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE a.affiliation = 'University of Toronto'\n",
            "MATCH (p)-[:CITES]->(c:Citation)\n",
            "WHERE c.conference = 'AAAI'\n",
            "RETURN avg(c.citations)\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "168 \n",
            "MATCH (paper:Paper {title: 'Transductive Inference for Text Classification using Support Vector Machines'})\n",
            "MATCH (paper)-[:CITES {source: 'Transductive Inference for Text Classification using Support Vector Machines'}]->(citation)\n",
            "RETURN paper, citation\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "169 \n",
            "MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE a.name = 'Michael I Jordan'\n",
            "RETURN p.title, p.year, p.keywords\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "170 \n",
            "MATCH (p:Conference {name: \"ICML\"})\n",
            "MATCH (p)-[:PUBLISHED]->(p:Paper {topic: \"Deep Learning\"})\n",
            "RETURN p\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "171 \n",
            "MATCH (p:paper)-[:AUTHOR]->(a:author)\n",
            "RETURN p.name, COUNT(a) AS num_authors\n",
            "ORDER BY num_authors DESC\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "172 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE a.name = 'Johns Hopkins University'\n",
            "AND p.conference = 'AAAI'\n",
            "RETURN p.date\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "173 MATCH (p:Paper)-[:CITES {source: \"ICML\"}]-(c:Citation)\n",
            "RETURN p.name, c.count\n",
            "ORDER BY c.count DESC\n",
            "LIMIT 1\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "174 MATCH (n:Author {name: \"Sebastian Thrun\"})\n",
            "MATCH (n1:Author {name: \"Michael I Jordan\"})\n",
            "MATCH (n-[R:COAUTHORSHIP]-n1)\n",
            "RETURN COUNT(n)\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "175 MATCH (p:Paper)-[:CITES {source: \"ACL\"}]-()\n",
            "RETURN p.name, COUNT(p) AS cites\n",
            "ORDER BY cites DESC\n",
            "LIMIT 5\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "176 \n",
            "MATCH (c:Conference)\n",
            "WHERE c.name = 'Daphne Koller'\n",
            "MATCH (a:Author)\n",
            "WHERE a.name = 'Daphne Koller'\n",
            "MATCH (a-[ATTENDED]->c)\n",
            "RETURN c.name\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "177 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author) WHERE a.affiliation = \"Stanford University\" AND p.topic = \"Parallel Computing\" RETURN p\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "178 MATCH (a:Author)-[:PUBLISHED {year: {Thrun: \"Sebastian Thrun\"}}]->(p:Paper)\n",
            "RETURN p.domain, COUNT(p) as frequency\n",
            "ORDER BY frequency DESC\n",
            "LIMIT 10;\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "179 MATCH (n:CONFERENCE{name: 'SIGGRAPH'})\n",
            "MATCH (n)-[:PUBLISHED_PAPER {year: 2015 TO 2020}]-(p)\n",
            "MATCH (p)-[:AUTHOR {name: 'John Doe'}]-(a)\n",
            "RETURN a.name, p.title, p.author, p.venue, p.year\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n",
            "ERROR:neo4j:Unable to retrieve routing information\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "180 \n",
            "MATCH (p:Paper)-[:PUBLISHED_IN]->(j:Journal)\n",
            "WHERE j.name = 'ACL' AND p.author = 'Stanford University'\n",
            "RETURN p.title\n",
            "\n",
            "181 MATCH (n:UNIVERSITY {name: 'AAAI'})\n",
            "RETURN n.citations\n",
            "ORDER BY n.citations DESC\n",
            "LIMIT 10;\n",
            "182 MATCH (a:Author)-[:COLLABORATES]->(p:Paper)\n",
            "WHERE p.conference.name = 'AAAI'\n",
            "RETURN a.name, COUNT(p) AS num_collaborations\n",
            "ORDER BY num_collaborations DESC\n",
            "LIMIT 10;\n",
            "183 \n",
            "MATCH (a:Author {name: \"Michael I Jordan\"})-[:AUTHOR_OF {paper:Paper}]->(p)\n",
            "MATCH (p)-[:PUBLISHED_IN {domain:Domain}]->(d)\n",
            "RETURN a.name, p.title, d.name\n",
            "\n",
            "184 []\n",
            "185 \n",
            "MATCH (a:Author {name: 'Daphne Koller'})\n",
            "MATCH (b:Paper {conference: 'SIGGRAPH'})\n",
            "MATCH (a)-[R]->(b)\n",
            "RETURN a.name, b.name, R.type\n",
            "\n",
            "186 []\n",
            "187 \n",
            "MATCH (n:INSTITUTION{name: \"University of Toronto\"})\n",
            "MATCH (n)-[:PUBLISHES]->(p:ARTICLE{conference: \"ICML\"})\n",
            "RETURN p.main_research_area\n",
            "\n",
            "188 MATCH (p:Paper)\n",
            "WHERE p.topic = 'Augmented Reality'\n",
            "RETURN p.influence\n",
            "ORDER BY p.influence DESC\n",
            "LIMIT 5;\n",
            "189 \n",
            "MATCH (a:Author)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE a.affiliation = \"University of Hong Kong\" AND p.field(\"information security\")\n",
            "RETURN a.name, p.title\n",
            "\n",
            "190 \n",
            "MATCH (a:author)-[:WRITTEN_BY]->(p:paper)\n",
            "WHERE a.name = 'Peter Stone' AND p.domain = 'Autonomous Agent'\n",
            "RETURN p.id\n",
            "\n",
            "191 []\n",
            "192 []\n",
            "193 []\n",
            "194 \n",
            "MATCH (p:Paper)-[:AUTHOR]->(a:Author)\n",
            "WHERE a.name = 'Machine Translation'\n",
            "RETURN p.name, COUNT(p)\n",
            "\n",
            "195 \n",
            "MATCH (n:Author {name: \"Sebastian Thrun\"})\n",
            "MATCH (n)-[:PUBLISHED_IN]->(p:Conference {name: \"AAAI\"})\n",
            "RETURN n.name, p.name\n",
            "\n",
            "196 MATCH (paper:ICML-Paper)-[:CITES {num_cites: > 10}]->(otherPaper:ICML-Paper)\n",
            "RETURN otherPaper.name, paper.name, otherPaper.num_cites, paper.num_cites\n",
            "197 \n",
            "MATCH (n:DOMAIN {name: 'SIGGRAPH'})\n",
            "RETURN n.name, n.incomingEdges(type: 'PAPER_IN_DOMAIN')\n",
            "ORDER BY n.incomingEdges(type: 'PAPER_IN_DOMAIN') DESC\n",
            "\n",
            "198 \n",
            "MATCH (d:Domain)-[:PUBLISHED]->(p:Paper)\n",
            "WHERE p.conferenceName = 'AAAI'\n",
            "RETURN d.name\n",
            "\n",
            "199 \n",
            "MATCH (n:AUTHOR {name: 'Daphne Koller'})\n",
            "MATCH (n)-[:CITES {paper: 'AAAI'}]-()\n",
            "RETURN count(n)\n",
            "\n",
            "200 \n",
            "MATCH (n:INSTITUTION{name: 'Carnegie Mellon University'})\n",
            "MATCH (n)-[:PUBLISHED_WORK]->(p:PUBLICATION{topic: 'Natural Language Processing'})\n",
            "RETURN p\n",
            "\n",
            "201 MATCH (n:CONFERENCE {name: 'AAAI'})\n",
            "MATCH (n)-[:PUBLISHED_PAPER {year: $year}]-()\n",
            "RETURN n.name, COUNT(n) AS count\n",
            "WHERE $year IN (2015, 2016, 2017, 2018, 2019)\n",
            "202 \n",
            "MATCH (c:Conference {name: 'ICML'})\n",
            "RETURN c.name, c.description, c.keywords, c.venue, c.date, c.speakers\n",
            "\n",
            "203 \n",
            "MATCH (c:ACL_CONFERENCE {year: $year})\n",
            "MATCH (p:ACL_PROGRAM {year: $year})\n",
            "WITH c, p\n",
            "CALL apendPaths(c, p)\n",
            "YIELD paths\n",
            "RETURN paths\n",
            "\n",
            "204 \n",
            "MATCH (n:ACL_CONFERENCE)\n",
            "RETURN n.name, COUNT(n.name)\n",
            "\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:neo4j:Failed to write data to connection ResolvedIPv4Address(('34.121.155.65', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n",
            "ERROR:neo4j:Failed to write data to connection IPv4Address(('8e7ec38d.databases.neo4j.io', 7687)) (ResolvedIPv4Address(('34.121.155.65', 7687)))\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "205 \n",
            "MATCH (p:paper)-[:AUTHOR]->(a:author)\n",
            "WHERE a.name = 'Stanford University' AND p.conference = 'ICML' AND p.topic = 'Machine Learning' AND p.topic = 'Computational Biology'\n",
            "RETURN p.id, COUNT(p)\n",
            "\n",
            "206 \n",
            "MATCH (p:Paper)-[:PUBLISHED]->()\n",
            "WHERE p.topic = 'Machine Learning'\n",
            "RETURN p.published\n",
            "\n",
            "207 MATCH (a:Author)-[:PUBLISHED]->(p:Publication)\n",
            "WHERE a.domain = 'Artificial Intelligence'\n",
            "RETURN a.name, COUNT(p) AS num_publications\n",
            "ORDER BY num_publications DESC\n",
            "LIMIT 3;\n",
            "208 \n",
            "MATCH (p:Paper)-[:PUBLISHED]->()\n",
            "WHERE p.title contains \"Relational Database\"\n",
            "AND p.publishedDate < Timestamp.now()\n",
            "RETURN p.title, p.publishedDate\n",
            "\n",
            "209 MATCH (p:Paper)-[:CITES {numCitations: $numCitations}]-()\n",
            "RETURN p.name, p.numCitations\n",
            "ORDER BY p.numCitations DESC\n",
            "LIMIT 1\n",
            "210 MATCH (c:Conference)\n",
            "WHERE (c.name IN ['Feature Vector'])\n",
            "RETURN c.name, COUNT(p) AS count\n",
            "ORDER BY count DESC\n",
            "LIMIT 5;\n",
            "211 MATCH (n:GRAPHICAL_MODEL {date: > (Date.now() - 10000)))\n",
            "RETURN n.name, n.description, n.methodology\n",
            "212 MATCH (a:Author)-[:PUBLISHED]->(p:Publication)\n",
            "RETURN a.name, COUNT(p) AS count\n",
            "ORDER BY count DESC\n",
            "LIMIT 10\n",
            "213 MATCH (p:Real-time Computing)\n",
            "WHERE p.date > Timestamp('now'-5years)\n",
            "WITH p, COUNT(p) as cites\n",
            "ORDER BY cites DESC\n",
            "RETURN p, cites\n",
            "214 \n",
            "MATCH (p:Paper)-[:PRESENTED_AT]->(conf:Conference {name: 'AAAI'})\n",
            "RETURN p.name, p.author, p.date\n",
            "\n",
            "215 MATCH (paper:AugmentedReality)-[:PUBLISHED]->(journal:SIGGRAPH)\n",
            "RETURN paper.title, paper.year, COUNT(paper) AS popularity\n",
            "ORDER BY popularity DESC\n",
            "LIMIT 10;\n",
            "216 []\n",
            "217 MATCH (p:Paper)-[:PUBLISHED]->()\n",
            "WHERE p.topic = \"Bioinformatics\" AND p.subtopic = \"Genomics\"\n",
            "RETURN p.title, p.publishDate\n",
            "ORDER BY p.publishDate DESC\n",
            "LIMIT 5\n",
            "218 MATCH (n:Author)-[:PUBLISHED {conference: \"conference1\", num_papers: 5, num_citations: 10}]-()\n",
            "MATCH (n:Author)-[:PUBLISHED {conference: \"conference2\", num_papers: 3, num_citations: 5}]-()\n",
            "...\n",
            "\n",
            "RETURN n.name, n.num_papers, n.num_citations\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "hBp-vdxhvpIq"
      },
      "source": [
        "## **train**"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 67,
          "referenced_widgets": [
            "7c05691b142d46d8a04c2d6cb57f0590",
            "a092611b40be4982adbb58f84a49c950",
            "a780efc74e074e73a1b73611330c8a5d",
            "bdd53c60e80d4e5d8f8d2523f28ea4f6",
            "30916fc369804a008d5468bae3f32188",
            "864c528bd35e4a2aa041749a567e432a",
            "c27f4a3740684b8784307f664987cf80",
            "c2839361a6094476882125e1227df859",
            "fa2218b8d382478cbd33d6c287d9e818",
            "3109b7c399a045fd9dcb370e3489bcfc",
            "59cb69db9cc0473a8f7ed05f556e3d46"
          ]
        },
        "id": "j98Dr_4jVbxh",
        "outputId": "982ff98e-dfec-4cde-f45c-2b667d27f5eb"
      },
      "outputs": [
        {
          "data": {
            "application/vnd.jupyter.widget-view+json": {
              "model_id": "7c05691b142d46d8a04c2d6cb57f0590",
              "version_major": 2,
              "version_minor": 0
            },
            "text/plain": [
              "evaluating...:   0%|          | 0/163 [00:00<?, ?it/s]"
            ]
          },
          "metadata": {},
          "output_type": "display_data"
        },
        {
          "data": {
            "text/plain": [
              "array([ 45.,  87.,   0.,  82.,  93., 147.])"
            ]
          },
          "execution_count": 11,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "# from tqdm.auto import tqdm\n",
        "# driver = GraphDatabase.driver(url, auth=(username, password))\n",
        "# results_train = np.zeros(6) #6 models runnable cypher\n",
        "# for i in tqdm(range(len(df_train)), \"evaluating...\"):\n",
        "#   row = df_train.iloc[i]\n",
        "#   palm2 = row['palm_generations']\n",
        "#   palm2_fine_tuned = row['fine_tuned_palm_generations']\n",
        "#   llama2 = row['llama_cleaned_generations']\n",
        "#   llama2_fine_tuned = row['fine_tuned_llama_cleaned_generations']\n",
        "#   gpt = row['gpt_generations']\n",
        "#   gpt_fine_tuned = row['gpt_fine_tuned_generations']\n",
        "#   cyphers  = [palm2, palm2_fine_tuned, llama2,llama2_fine_tuned, gpt, gpt_fine_tuned]\n",
        "#   for j, cy in enumerate(cyphers):\n",
        "#     try:\n",
        "#       cypher = cy.lower()\n",
        "#       out = run(driver, cypher)\n",
        "#       if out !=[]:\n",
        "#         results_train[j]+=1\n",
        "#     except:\n",
        "#       pass\n",
        "# results_train\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "JUDBjbOv9fk2"
      },
      "source": [
        "## **Results**"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "bX4ub4gCT_eN"
      },
      "outputs": [],
      "source": [
        "df_metrics = pd.DataFrame([(results_all-results)/len(df_train), results/len(df_test), results_all/len(df)],\n",
        "                          columns = ['Palm2', 'Palm2_Fine_tuned', 'Llama2', 'Llama2_LoRA_tuned', 'GPT3.5', 'GPT3.5_Fine_tuned'])"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 143
        },
        "id": "NNm92tMeU2rZ",
        "outputId": "94b26587-0b04-45d1-9c91-62d9dd5cec88"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                      Palm2  Palm2_Fine_tuned    Llama2  Llama2_LoRA_tuned  \\\n",
              "Train runnable     0.245399          0.822086  0.055215           0.460123   \n",
              "Test runnable      0.464286          0.964286  0.160714           0.892857   \n",
              "All data runnable  0.301370          0.858447  0.082192           0.570776   \n",
              "\n",
              "                     GPT3.5  GPT3.5_Fine_tuned  \n",
              "Train runnable     0.552147           0.883436  \n",
              "Test runnable      0.821429           0.964286  \n",
              "All data runnable  0.621005           0.904110  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-65721dd0-c28f-4b2a-91b1-9bc52699a76d\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Palm2</th>\n",
              "      <th>Palm2_Fine_tuned</th>\n",
              "      <th>Llama2</th>\n",
              "      <th>Llama2_LoRA_tuned</th>\n",
              "      <th>GPT3.5</th>\n",
              "      <th>GPT3.5_Fine_tuned</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>Train runnable</th>\n",
              "      <td>0.245399</td>\n",
              "      <td>0.822086</td>\n",
              "      <td>0.055215</td>\n",
              "      <td>0.460123</td>\n",
              "      <td>0.552147</td>\n",
              "      <td>0.883436</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>Test runnable</th>\n",
              "      <td>0.464286</td>\n",
              "      <td>0.964286</td>\n",
              "      <td>0.160714</td>\n",
              "      <td>0.892857</td>\n",
              "      <td>0.821429</td>\n",
              "      <td>0.964286</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>All data runnable</th>\n",
              "      <td>0.301370</td>\n",
              "      <td>0.858447</td>\n",
              "      <td>0.082192</td>\n",
              "      <td>0.570776</td>\n",
              "      <td>0.621005</td>\n",
              "      <td>0.904110</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-65721dd0-c28f-4b2a-91b1-9bc52699a76d')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-65721dd0-c28f-4b2a-91b1-9bc52699a76d button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-65721dd0-c28f-4b2a-91b1-9bc52699a76d');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-80387b6f-231b-445c-a35e-3fbc1cf3131d\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-80387b6f-231b-445c-a35e-3fbc1cf3131d')\"\n",
              "            title=\"Suggest charts\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "      --bg-color: #E8F0FE;\n",
              "      --fill-color: #1967D2;\n",
              "      --hover-bg-color: #E2EBFA;\n",
              "      --hover-fill-color: #174EA6;\n",
              "      --disabled-fill-color: #AAA;\n",
              "      --disabled-bg-color: #DDD;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "      --bg-color: #3B4455;\n",
              "      --fill-color: #D2E3FC;\n",
              "      --hover-bg-color: #434B5C;\n",
              "      --hover-fill-color: #FFFFFF;\n",
              "      --disabled-bg-color: #3B4455;\n",
              "      --disabled-fill-color: #666;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart {\n",
              "    background-color: var(--bg-color);\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: var(--fill-color);\n",
              "    height: 32px;\n",
              "    padding: 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: var(--hover-bg-color);\n",
              "    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: var(--button-hover-fill-color);\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart-complete:disabled,\n",
              "  .colab-df-quickchart-complete:disabled:hover {\n",
              "    background-color: var(--disabled-bg-color);\n",
              "    fill: var(--disabled-fill-color);\n",
              "    box-shadow: none;\n",
              "  }\n",
              "\n",
              "  .colab-df-spinner {\n",
              "    border: 2px solid var(--fill-color);\n",
              "    border-color: transparent;\n",
              "    border-bottom-color: var(--fill-color);\n",
              "    animation:\n",
              "      spin 1s steps(1) infinite;\n",
              "  }\n",
              "\n",
              "  @keyframes spin {\n",
              "    0% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "      border-left-color: var(--fill-color);\n",
              "    }\n",
              "    20% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    30% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    40% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    60% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    80% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "    90% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const quickchartButtonEl =\n",
              "        document.querySelector('#' + key + ' button');\n",
              "      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n",
              "      quickchartButtonEl.classList.add('colab-df-spinner');\n",
              "      try {\n",
              "        const charts = await google.colab.kernel.invokeFunction(\n",
              "            'suggestCharts', [key], {});\n",
              "      } catch (error) {\n",
              "        console.error('Error during call to suggestCharts:', error);\n",
              "      }\n",
              "      quickchartButtonEl.classList.remove('colab-df-spinner');\n",
              "      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-80387b6f-231b-445c-a35e-3fbc1cf3131d button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 28
        }
      ],
      "source": [
        "df_metrics.index = [\"Train runnable\", \"Test runnable\",  \"All data runnable\"]\n",
        "df_metrics"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "YqT9wLCiATuB"
      },
      "outputs": [],
      "source": [
        "!pip install nltk rouge -q\n",
        "from nltk.translate.bleu_score import sentence_bleu\n",
        "from rouge import Rouge\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "A2PXg3yaYrDs",
        "outputId": "7cb604a2-7a50-4d81-bad4-205c43dda829"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "[0.72597953 0.77777778 0.75       0.77777778]\n"
          ]
        }
      ],
      "source": [
        "\n",
        "def calculate_bleu_rouge(reference, candidate):\n",
        "    \"\"\"\n",
        "    Calculate BLEU and ROUGE scores for a pair of strings.\n",
        "\n",
        "    :param reference: The reference string (ground truth).\n",
        "    :param candidate: The candidate string (generated text).\n",
        "    :return: A dictionary containing BLEU and ROUGE scores.\n",
        "    \"\"\"\n",
        "    # Preprocessing the strings: tokenizing into words\n",
        "    reference_tokens = reference.split()\n",
        "    candidate_tokens = candidate.split()\n",
        "\n",
        "    # Calculating BLEU score\n",
        "    bleu_score = sentence_bleu([reference_tokens], candidate_tokens)\n",
        "\n",
        "    # Calculating ROUGE score\n",
        "    rouge = Rouge()\n",
        "    rouge_score = rouge.get_scores(candidate, reference)[0]\n",
        "\n",
        "    return np.array([bleu_score,rouge_score['rouge-1']['r'], rouge_score['rouge-2']['r'], rouge_score['rouge-l']['r']])\n",
        "\n",
        "# Example usage\n",
        "reference_text = \"The quick brown fox jumps over the lazy dog\"\n",
        "candidate_text = \"A fast brown fox jumps over the lazy dog\"\n",
        "scores = calculate_bleu_rouge(reference_text, candidate_text)\n",
        "\n",
        "print(scores)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 370,
          "referenced_widgets": [
            "4ec4b9d040d94fb39d04072ff4ca796b",
            "5c9aa43bc7734c9ba0ee4649f74ef654",
            "0e4f907a7dac423f87b6621ea0dda6d0",
            "883a3d80587c4b60a452cb8288a32986",
            "9b29d46dfe6449fc9391918654a126c4",
            "f556dafe8b544e06bd4b9c2a9e90b54e",
            "ac9c6270dd2b4a6aa9fcfad535a300bd",
            "29870c9b3ccc40ad86d017cb5bd6110e",
            "42c81721ebdb4810870ac1f50680addb",
            "0f8316b079f04004bfd3069a45744783",
            "54f30da002eb4d529e8eed9bdc5e8922"
          ]
        },
        "id": "f-Juno-JAmRu",
        "outputId": "b9562d32-8626-4284-fd45-0d873bd583b7"
      },
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "evaluating...:   0%|          | 0/219 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "4ec4b9d040d94fb39d04072ff4ca796b"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "/usr/local/lib/python3.10/dist-packages/nltk/translate/bleu_score.py:552: UserWarning: \n",
            "The hypothesis contains 0 counts of 4-gram overlaps.\n",
            "Therefore the BLEU score evaluates to 0, independently of\n",
            "how many N-gram overlaps of lower order it contains.\n",
            "Consider using lower n-gram order or use SmoothingFunction()\n",
            "  warnings.warn(_msg)\n",
            "/usr/local/lib/python3.10/dist-packages/nltk/translate/bleu_score.py:552: UserWarning: \n",
            "The hypothesis contains 0 counts of 2-gram overlaps.\n",
            "Therefore the BLEU score evaluates to 0, independently of\n",
            "how many N-gram overlaps of lower order it contains.\n",
            "Consider using lower n-gram order or use SmoothingFunction()\n",
            "  warnings.warn(_msg)\n",
            "/usr/local/lib/python3.10/dist-packages/nltk/translate/bleu_score.py:552: UserWarning: \n",
            "The hypothesis contains 0 counts of 3-gram overlaps.\n",
            "Therefore the BLEU score evaluates to 0, independently of\n",
            "how many N-gram overlaps of lower order it contains.\n",
            "Consider using lower n-gram order or use SmoothingFunction()\n",
            "  warnings.warn(_msg)\n"
          ]
        }
      ],
      "source": [
        "from tqdm.auto import tqdm\n",
        "driver = GraphDatabase.driver(url, auth=(username, password))\n",
        "scores_all = np.zeros((6,4)) #6 models runnable cypher, 4 metrics\n",
        "for i in tqdm(range(len(df)), \"evaluating...\"):\n",
        "  row = df.iloc[i]\n",
        "  palm2 = row['palm_generations']\n",
        "  palm2_fine_tuned = row['fine_tuned_palm_generations']\n",
        "  llama2 = row['llama_cleaned_generations']\n",
        "  llama2_fine_tuned = row['fine_tuned_llama_cleaned_generations']\n",
        "  gpt = row['gpt_generations']\n",
        "  gpt_fine_tuned = row['gpt_fine_tuned_generations']\n",
        "  cyphers  = [palm2, palm2_fine_tuned, llama2,llama2_fine_tuned, gpt, gpt_fine_tuned]\n",
        "  label = row['cypher']\n",
        "  for j, cy in enumerate(cyphers):\n",
        "    scores_all[j]+= calculate_bleu_rouge(cy, label)\n",
        "\n",
        "\n",
        "scores_all = scores_all/len(df)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 175
        },
        "id": "bEqAImsxBx9Q",
        "outputId": "91062679-4fca-4e72-fa3d-f79d83593488"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "            Palm2  Palm2_Fine_tuned    Llama2  Llama2_LoRA_tuned    GPT3.5  \\\n",
              "BLEU     0.060464          0.501861  0.017014           0.479566  0.154573   \n",
              "ROUGE-1  0.501176          0.794085  0.395649           0.640206  0.595740   \n",
              "ROUGE-2  0.218997          0.617748  0.133927           0.549149  0.315950   \n",
              "ROUGE-L  0.499025          0.790795  0.392483           0.638954  0.589947   \n",
              "\n",
              "         GPT3.5_Fine_tuned  \n",
              "BLEU              0.786719  \n",
              "ROUGE-1           0.907770  \n",
              "ROUGE-2           0.832935  \n",
              "ROUGE-L           0.905520  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-ab3a4b01-74f3-4ed6-bf6a-e7f536948176\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>Palm2</th>\n",
              "      <th>Palm2_Fine_tuned</th>\n",
              "      <th>Llama2</th>\n",
              "      <th>Llama2_LoRA_tuned</th>\n",
              "      <th>GPT3.5</th>\n",
              "      <th>GPT3.5_Fine_tuned</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>BLEU</th>\n",
              "      <td>0.060464</td>\n",
              "      <td>0.501861</td>\n",
              "      <td>0.017014</td>\n",
              "      <td>0.479566</td>\n",
              "      <td>0.154573</td>\n",
              "      <td>0.786719</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>ROUGE-1</th>\n",
              "      <td>0.501176</td>\n",
              "      <td>0.794085</td>\n",
              "      <td>0.395649</td>\n",
              "      <td>0.640206</td>\n",
              "      <td>0.595740</td>\n",
              "      <td>0.907770</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>ROUGE-2</th>\n",
              "      <td>0.218997</td>\n",
              "      <td>0.617748</td>\n",
              "      <td>0.133927</td>\n",
              "      <td>0.549149</td>\n",
              "      <td>0.315950</td>\n",
              "      <td>0.832935</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>ROUGE-L</th>\n",
              "      <td>0.499025</td>\n",
              "      <td>0.790795</td>\n",
              "      <td>0.392483</td>\n",
              "      <td>0.638954</td>\n",
              "      <td>0.589947</td>\n",
              "      <td>0.905520</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-ab3a4b01-74f3-4ed6-bf6a-e7f536948176')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-ab3a4b01-74f3-4ed6-bf6a-e7f536948176 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-ab3a4b01-74f3-4ed6-bf6a-e7f536948176');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-f2e20306-aaa5-4e8c-8bdc-b78f0b6e883e\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-f2e20306-aaa5-4e8c-8bdc-b78f0b6e883e')\"\n",
              "            title=\"Suggest charts\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "      --bg-color: #E8F0FE;\n",
              "      --fill-color: #1967D2;\n",
              "      --hover-bg-color: #E2EBFA;\n",
              "      --hover-fill-color: #174EA6;\n",
              "      --disabled-fill-color: #AAA;\n",
              "      --disabled-bg-color: #DDD;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "      --bg-color: #3B4455;\n",
              "      --fill-color: #D2E3FC;\n",
              "      --hover-bg-color: #434B5C;\n",
              "      --hover-fill-color: #FFFFFF;\n",
              "      --disabled-bg-color: #3B4455;\n",
              "      --disabled-fill-color: #666;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart {\n",
              "    background-color: var(--bg-color);\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: var(--fill-color);\n",
              "    height: 32px;\n",
              "    padding: 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: var(--hover-bg-color);\n",
              "    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: var(--button-hover-fill-color);\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart-complete:disabled,\n",
              "  .colab-df-quickchart-complete:disabled:hover {\n",
              "    background-color: var(--disabled-bg-color);\n",
              "    fill: var(--disabled-fill-color);\n",
              "    box-shadow: none;\n",
              "  }\n",
              "\n",
              "  .colab-df-spinner {\n",
              "    border: 2px solid var(--fill-color);\n",
              "    border-color: transparent;\n",
              "    border-bottom-color: var(--fill-color);\n",
              "    animation:\n",
              "      spin 1s steps(1) infinite;\n",
              "  }\n",
              "\n",
              "  @keyframes spin {\n",
              "    0% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "      border-left-color: var(--fill-color);\n",
              "    }\n",
              "    20% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    30% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    40% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    60% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    80% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "    90% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const quickchartButtonEl =\n",
              "        document.querySelector('#' + key + ' button');\n",
              "      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n",
              "      quickchartButtonEl.classList.add('colab-df-spinner');\n",
              "      try {\n",
              "        const charts = await google.colab.kernel.invokeFunction(\n",
              "            'suggestCharts', [key], {});\n",
              "      } catch (error) {\n",
              "        console.error('Error during call to suggestCharts:', error);\n",
              "      }\n",
              "      quickchartButtonEl.classList.remove('colab-df-spinner');\n",
              "      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-f2e20306-aaa5-4e8c-8bdc-b78f0b6e883e button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 30
        }
      ],
      "source": [
        "df_nlp_score = pd.DataFrame(scores_all.T, columns = ['Palm2', 'Palm2_Fine_tuned', 'Llama2', 'Llama2_LoRA_tuned', 'GPT3.5', 'GPT3.5_Fine_tuned'])\n",
        "df_nlp_score.index = [\"BLEU\", \"ROUGE-1\",  \"ROUGE-2\", \"ROUGE-L\"]\n",
        "df_nlp_score"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "-dALdQdHB6iV"
      },
      "outputs": [],
      "source": []
    }
  ],
  "metadata": {
    "colab": {
      "collapsed_sections": [
        "hBp-vdxhvpIq"
      ],
      "provenance": [],
      "authorship_tag": "ABX9TyN0aOg0J79n2DWbWMuWNfmf",
      "include_colab_link": true
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    },
    "widgets": {
      "application/vnd.jupyter.widget-state+json": {
        "30916fc369804a008d5468bae3f32188": {
          "model_module": "@jupyter-widgets/base",
          "model_module_version": "1.2.0",
          "model_name": "LayoutModel",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "3109b7c399a045fd9dcb370e3489bcfc": {
          "model_module": "@jupyter-widgets/base",
          "model_module_version": "1.2.0",
          "model_name": "LayoutModel",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "59cb69db9cc0473a8f7ed05f556e3d46": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "DescriptionStyleModel",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "7c05691b142d46d8a04c2d6cb57f0590": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "HBoxModel",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_a092611b40be4982adbb58f84a49c950",
              "IPY_MODEL_a780efc74e074e73a1b73611330c8a5d",
              "IPY_MODEL_bdd53c60e80d4e5d8f8d2523f28ea4f6"
            ],
            "layout": "IPY_MODEL_30916fc369804a008d5468bae3f32188"
          }
        },
        "864c528bd35e4a2aa041749a567e432a": {
          "model_module": "@jupyter-widgets/base",
          "model_module_version": "1.2.0",
          "model_name": "LayoutModel",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "a092611b40be4982adbb58f84a49c950": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "HTMLModel",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_864c528bd35e4a2aa041749a567e432a",
            "placeholder": "",
            "style": "IPY_MODEL_c27f4a3740684b8784307f664987cf80",
            "value": "evaluating...: 100%"
          }
        },
        "a780efc74e074e73a1b73611330c8a5d": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "FloatProgressModel",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_c2839361a6094476882125e1227df859",
            "max": 163,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_fa2218b8d382478cbd33d6c287d9e818",
            "value": 163
          }
        },
        "bdd53c60e80d4e5d8f8d2523f28ea4f6": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "HTMLModel",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_3109b7c399a045fd9dcb370e3489bcfc",
            "placeholder": "",
            "style": "IPY_MODEL_59cb69db9cc0473a8f7ed05f556e3d46",
            "value": " 163/163 [02:23&lt;00:00,  1.31it/s]"
          }
        },
        "c27f4a3740684b8784307f664987cf80": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "DescriptionStyleModel",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "c2839361a6094476882125e1227df859": {
          "model_module": "@jupyter-widgets/base",
          "model_module_version": "1.2.0",
          "model_name": "LayoutModel",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "fa2218b8d382478cbd33d6c287d9e818": {
          "model_module": "@jupyter-widgets/controls",
          "model_module_version": "1.5.0",
          "model_name": "ProgressStyleModel",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "cbfac6fefd544f10935b976d8c4444c6": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_bcd29cbfd8294c0eb0b61a995d1cf5e2",
              "IPY_MODEL_ce5b619804454692a7548fd033b0d18c",
              "IPY_MODEL_f29cdc9554684c7980672c4f769100ee"
            ],
            "layout": "IPY_MODEL_71a6d76b6ee448a8b5ef00dd022aee05"
          }
        },
        "bcd29cbfd8294c0eb0b61a995d1cf5e2": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_58d459d442d84413a663e80d064d61ed",
            "placeholder": "",
            "style": "IPY_MODEL_32265b82ac144c20943a43b9ad495a5a",
            "value": "evaluating...: 100%"
          }
        },
        "ce5b619804454692a7548fd033b0d18c": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_811a4a42b9cf4ec5951eaf59d77a3c5e",
            "max": 56,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_baff0294370849ef8794b3795d259cee",
            "value": 56
          }
        },
        "f29cdc9554684c7980672c4f769100ee": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_7add8be5deba439f9da58d636c7e626f",
            "placeholder": "",
            "style": "IPY_MODEL_f49c81ec2a7e466496459a989236999c",
            "value": " 56/56 [01:06&lt;00:00,  1.02it/s]"
          }
        },
        "71a6d76b6ee448a8b5ef00dd022aee05": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "58d459d442d84413a663e80d064d61ed": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "32265b82ac144c20943a43b9ad495a5a": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "811a4a42b9cf4ec5951eaf59d77a3c5e": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "baff0294370849ef8794b3795d259cee": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "7add8be5deba439f9da58d636c7e626f": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "f49c81ec2a7e466496459a989236999c": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "6d8654d349af4660b9daaf05da61ffe3": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_655c98692d954fddbb2d88f9874687e1",
              "IPY_MODEL_e03c599059694d2fb5654d59c7a7a2a3",
              "IPY_MODEL_ec52496af3be40bdbb78e08c2d4404ee"
            ],
            "layout": "IPY_MODEL_86038e18c173415aa2283944f9fdeb1a"
          }
        },
        "655c98692d954fddbb2d88f9874687e1": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_09821c037d4649ff86a092eb05941ac7",
            "placeholder": "",
            "style": "IPY_MODEL_739141131b314476ad02f50e52cfa755",
            "value": "evaluating...:  20%"
          }
        },
        "e03c599059694d2fb5654d59c7a7a2a3": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_595ad28f9d204b9ebb06338c06d5795e",
            "max": 219,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_ffbebf48d26f4698a129f327cd4829ed",
            "value": 43
          }
        },
        "ec52496af3be40bdbb78e08c2d4404ee": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_1e40d61512f441ffbe14bfbefb1077f4",
            "placeholder": "",
            "style": "IPY_MODEL_0d2612c4c9c646389f0c8301707b0cdb",
            "value": " 43/219 [00:26&lt;01:20,  2.20it/s]"
          }
        },
        "86038e18c173415aa2283944f9fdeb1a": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "09821c037d4649ff86a092eb05941ac7": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "739141131b314476ad02f50e52cfa755": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "595ad28f9d204b9ebb06338c06d5795e": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "ffbebf48d26f4698a129f327cd4829ed": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "1e40d61512f441ffbe14bfbefb1077f4": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "0d2612c4c9c646389f0c8301707b0cdb": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "a4684766f9704508aa8b951673caf01f": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_269fe17ff72e4e15851db7004c7d83b2",
              "IPY_MODEL_9c4d1e272a2d4c35afe2d550a0fcea2e",
              "IPY_MODEL_85435a6a73d34a688368cf240bd2e0f8"
            ],
            "layout": "IPY_MODEL_e78d417f63fe4f6faa1fe89467c7f607"
          }
        },
        "269fe17ff72e4e15851db7004c7d83b2": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_2771479d111841aea723c611e1fd7ecd",
            "placeholder": "",
            "style": "IPY_MODEL_58a265098ad34213b26d95e9bb9ad9de",
            "value": "evaluating...: 100%"
          }
        },
        "9c4d1e272a2d4c35afe2d550a0fcea2e": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_7ae4ded16aa049a4bbaafa4830806c13",
            "max": 89,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_63fb3148442749129773bdaecb3cb7fb",
            "value": 89
          }
        },
        "85435a6a73d34a688368cf240bd2e0f8": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f71898e77b2f4ee7ba603cbd6cf7a08a",
            "placeholder": "",
            "style": "IPY_MODEL_75c967d9fdff4ed4a8f9302efa9006b5",
            "value": " 89/89 [05:02&lt;00:00,  1.04it/s]"
          }
        },
        "e78d417f63fe4f6faa1fe89467c7f607": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "2771479d111841aea723c611e1fd7ecd": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "58a265098ad34213b26d95e9bb9ad9de": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "7ae4ded16aa049a4bbaafa4830806c13": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "63fb3148442749129773bdaecb3cb7fb": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "f71898e77b2f4ee7ba603cbd6cf7a08a": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "75c967d9fdff4ed4a8f9302efa9006b5": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "4ec4b9d040d94fb39d04072ff4ca796b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_5c9aa43bc7734c9ba0ee4649f74ef654",
              "IPY_MODEL_0e4f907a7dac423f87b6621ea0dda6d0",
              "IPY_MODEL_883a3d80587c4b60a452cb8288a32986"
            ],
            "layout": "IPY_MODEL_9b29d46dfe6449fc9391918654a126c4"
          }
        },
        "5c9aa43bc7734c9ba0ee4649f74ef654": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f556dafe8b544e06bd4b9c2a9e90b54e",
            "placeholder": "",
            "style": "IPY_MODEL_ac9c6270dd2b4a6aa9fcfad535a300bd",
            "value": "evaluating...: 100%"
          }
        },
        "0e4f907a7dac423f87b6621ea0dda6d0": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_29870c9b3ccc40ad86d017cb5bd6110e",
            "max": 219,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_42c81721ebdb4810870ac1f50680addb",
            "value": 219
          }
        },
        "883a3d80587c4b60a452cb8288a32986": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_0f8316b079f04004bfd3069a45744783",
            "placeholder": "",
            "style": "IPY_MODEL_54f30da002eb4d529e8eed9bdc5e8922",
            "value": " 219/219 [00:00&lt;00:00, 230.10it/s]"
          }
        },
        "9b29d46dfe6449fc9391918654a126c4": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "f556dafe8b544e06bd4b9c2a9e90b54e": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "ac9c6270dd2b4a6aa9fcfad535a300bd": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "29870c9b3ccc40ad86d017cb5bd6110e": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "42c81721ebdb4810870ac1f50680addb": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "0f8316b079f04004bfd3069a45744783": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "54f30da002eb4d529e8eed9bdc5e8922": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        }
      }
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}